Tekla Open API Reference for Tekla Structures 2025
OBB.GetHashCode Method
 Gets the hash code for the obb.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
Hash code for the obb.
See Also
Reference
OBB Class
Tekla.Structures.Geometry3d Namespace